performance/raquetelio/results/artilleryRaceRegistration_result_Test77_2022-11-19-19-35-1668882958.txt
Phase started: Warm up (index: 0, duration: 30s) 19:36:01(+0100)

--------------------------------------
Metrics for period to: 19:36:10(+0100) (width: 7.044s)
--------------------------------------

http.codes.201: ................................................................ 8
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 8
http.response_time:
  min: ......................................................................... 27
  max: ......................................................................... 374
  median: ...................................................................... 30.3
  p95: ......................................................................... 55.2
  p99: ......................................................................... 55.2
http.responses: ................................................................ 8
vusers.completed: .............................................................. 8
vusers.created: ................................................................ 8
vusers.created_by_name.Register in Race by Order: .............................. 8
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 34
  max: ......................................................................... 411.2
  median: ...................................................................... 47.9
  p95: ......................................................................... 68.7
  p99: ......................................................................... 68.7


Phase completed: Warm up (index: 0, duration: 30s) 19:36:31(+0100)

Phase started: Massive load (index: 1, duration: 30s) 19:36:31(+0100)

--------------------------------------
Metrics for period to: 19:36:20(+0100) (width: 9.052s)
--------------------------------------

http.codes.201: ................................................................ 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 19
  max: ......................................................................... 85
  median: ...................................................................... 30.9
  p95: ......................................................................... 55.2
  p99: ......................................................................... 55.2
http.responses: ................................................................ 10
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Register in Race by Order: .............................. 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 23.5
  max: ......................................................................... 105.3
  median: ...................................................................... 37
  p95: ......................................................................... 68.7
  p99: ......................................................................... 68.7


--------------------------------------
Metrics for period to: 19:36:30(+0100) (width: 9.033s)
--------------------------------------

http.codes.201: ................................................................ 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 17
  max: ......................................................................... 79
  median: ...................................................................... 29.1
  p95: ......................................................................... 55.2
  p99: ......................................................................... 55.2
http.responses: ................................................................ 10
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Register in Race by Order: .............................. 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20.3
  max: ......................................................................... 89.7
  median: ...................................................................... 33.5
  p95: ......................................................................... 63.4
  p99: ......................................................................... 63.4


--------------------------------------
Metrics for period to: 19:36:40(+0100) (width: 9.784s)
--------------------------------------

http.codes.201: ................................................................ 178
http.codes.400: ................................................................ 183
http.codes.500: ................................................................ 8
http.request_rate: ............................................................. 646/sec
http.requests: ................................................................. 5790
http.response_time:
  min: ......................................................................... 29
  max: ......................................................................... 7896
  median: ...................................................................... 3534.1
  p95: ......................................................................... 7260.8
  p99: ......................................................................... 7557.1
http.responses: ................................................................ 369
vusers.completed: .............................................................. 369
vusers.created: ................................................................ 5792
vusers.created_by_name.Register in Race by Order: .............................. 5792
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 35
  max: ......................................................................... 7898.9
  median: ...................................................................... 3534.1
  p95: ......................................................................... 7260.8
  p99: ......................................................................... 7557.1


--------------------------------------
Metrics for period to: 19:36:50(+0100) (width: 9.994s)
--------------------------------------

http.codes.201: ................................................................ 223
http.codes.400: ................................................................ 146
http.codes.500: ................................................................ 4
http.codes.503: ................................................................ 253
http.request_rate: ............................................................. 719/sec
http.requests: ................................................................. 7188
http.response_time:
  min: ......................................................................... 2854
  max: ......................................................................... 18220
  median: ...................................................................... 8868.4
  p95: ......................................................................... 16486.1
  p99: ......................................................................... 17505.6
http.responses: ................................................................ 626
vusers.completed: .............................................................. 626
vusers.created: ................................................................ 7187
vusers.created_by_name.Register in Race by Order: .............................. 7187
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2855.3
  max: ......................................................................... 18235.9
  median: ...................................................................... 8868.4
  p95: ......................................................................... 16486.1
  p99: ......................................................................... 17505.6


--------------------------------------
Metrics for period to: 19:37:00(+0100) (width: 9.998s)
--------------------------------------

http.codes.201: ................................................................ 214
http.codes.400: ................................................................ 402
http.codes.500: ................................................................ 3
http.codes.503: ................................................................ 5209
http.request_rate: ............................................................. 224/sec
http.requests: ................................................................. 2233
http.response_time:
  min: ......................................................................... 212
  max: ......................................................................... 27689
  median: ...................................................................... 7117
  p95: ......................................................................... 24594.7
  p99: ......................................................................... 26643.2
http.responses: ................................................................ 5828
vusers.completed: .............................................................. 5828
vusers.created: ................................................................ 2232
vusers.created_by_name.Register in Race by Order: .............................. 2232
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 221.5
  max: ......................................................................... 27690.9
  median: ...................................................................... 7117
  p95: ......................................................................... 24594.7
  p99: ......................................................................... 26643.2


--------------------------------------
Metrics for period to: 19:37:10(+0100) (width: 9.996s)
--------------------------------------

http.codes.201: ................................................................ 289
http.codes.400: ................................................................ 539
http.codes.500: ................................................................ 1
http.codes.503: ................................................................ 518
http.request_rate: ............................................................. 209/sec
http.requests: ................................................................. 2087
http.response_time:
  min: ......................................................................... 23
  max: ......................................................................... 35607
  median: ...................................................................... 28290.8
  p95: ......................................................................... 34554.7
  p99: ......................................................................... 35252.8
http.responses: ................................................................ 1347
vusers.completed: .............................................................. 1347
vusers.created: ................................................................ 2087
vusers.created_by_name.Register in Race by Order: .............................. 2087
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 38.2
  max: ......................................................................... 35608.4
  median: ...................................................................... 28290.8
  p95: ......................................................................... 34554.7
  p99: ......................................................................... 35252.8


--------------------------------------
Metrics for period to: 19:37:20(+0100) (width: 9.999s)
--------------------------------------

http.codes.201: ................................................................ 183
http.codes.400: ................................................................ 411
http.codes.503: ................................................................ 1552
http.codes.504: ................................................................ 2583
http.request_rate: ............................................................. 160/sec
http.requests: ................................................................. 1591
http.response_time:
  min: ......................................................................... 134
  max: ......................................................................... 41176
  median: ...................................................................... 40550.5
  p95: ......................................................................... 40550.5
  p99: ......................................................................... 41369.7
http.responses: ................................................................ 4729
vusers.completed: .............................................................. 4729
vusers.created: ................................................................ 1591
vusers.created_by_name.Register in Race by Order: .............................. 1591
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 143.2
  max: ......................................................................... 41177.5
  median: ...................................................................... 40550.5
  p95: ......................................................................... 40550.5
  p99: ......................................................................... 41369.7


--------------------------------------
Metrics for period to: 19:37:30(+0100) (width: 9.999s)
--------------------------------------

http.codes.503: ................................................................ 161
http.codes.504: ................................................................ 3734
http.request_rate: ............................................................. 184/sec
http.requests: ................................................................. 1835
http.response_time:
  min: ......................................................................... 401
  max: ......................................................................... 44702
  median: ...................................................................... 41369.7
  p95: ......................................................................... 43058.1
  p99: ......................................................................... 43928
http.responses: ................................................................ 3895
vusers.completed: .............................................................. 3895
vusers.created: ................................................................ 1836
vusers.created_by_name.Register in Race by Order: .............................. 1836
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 413.6
  max: ......................................................................... 44703.9
  median: ...................................................................... 41369.7
  p95: ......................................................................... 43058.1
  p99: ......................................................................... 43928


Phase completed: Massive load (index: 1, duration: 30s) 19:37:39(+0100)

--------------------------------------
Metrics for period to: 19:37:40(+0100) (width: 9.999s)
--------------------------------------

http.codes.503: ................................................................ 2113
http.codes.504: ................................................................ 568
http.request_rate: ............................................................. 237/sec
http.requests: ................................................................. 2339
http.response_time:
  min: ......................................................................... 107
  max: ......................................................................... 47330
  median: ...................................................................... 3534.1
  p95: ......................................................................... 45720.8
  p99: ......................................................................... 46644.4
http.responses: ................................................................ 2681
vusers.completed: .............................................................. 2681
vusers.created: ................................................................ 2338
vusers.created_by_name.Register in Race by Order: .............................. 2338
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 122.8
  max: ......................................................................... 47335.8
  median: ...................................................................... 3534.1
  p95: ......................................................................... 45720.8
  p99: ......................................................................... 46644.4


--------------------------------------
Metrics for period to: 19:37:50(+0100) (width: 9.973s)
--------------------------------------

http.codes.503: ................................................................ 324
http.codes.504: ................................................................ 894
http.request_rate: ............................................................. 243/sec
http.requests: ................................................................. 939
http.response_time:
  min: ......................................................................... 144
  max: ......................................................................... 43612
  median: ...................................................................... 40550.5
  p95: ......................................................................... 43058.1
  p99: ......................................................................... 43058.1
http.responses: ................................................................ 1218
vusers.completed: .............................................................. 1218
vusers.created: ................................................................ 939
vusers.created_by_name.Register in Race by Order: .............................. 939
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 152.8
  max: ......................................................................... 43629.1
  median: ...................................................................... 40550.5
  p95: ......................................................................... 43058.1
  p99: ......................................................................... 43928


--------------------------------------
Metrics for period to: 19:38:00(+0100) (width: 9.906s)
--------------------------------------

http.codes.504: ................................................................ 748
http.response_time:
  min: ......................................................................... 40002
  max: ......................................................................... 45201
  median: ...................................................................... 41369.7
  p95: ......................................................................... 43928
  p99: ......................................................................... 43928
http.responses: ................................................................ 748
vusers.completed: .............................................................. 748
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 40010
  max: ......................................................................... 45208.7
  median: ...................................................................... 41369.7
  p95: ......................................................................... 43928
  p99: ......................................................................... 43928


--------------------------------------
Metrics for period to: 19:38:10(+0100) (width: 9.853s)
--------------------------------------

http.codes.504: ................................................................ 756
http.response_time:
  min: ......................................................................... 40010
  max: ......................................................................... 45260
  median: ...................................................................... 43928
  p95: ......................................................................... 44815.4
  p99: ......................................................................... 44815.4
http.responses: ................................................................ 756
vusers.completed: .............................................................. 756
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 40043.5
  max: ......................................................................... 45275.3
  median: ...................................................................... 43928
  p95: ......................................................................... 44815.4
  p99: ......................................................................... 44815.4


--------------------------------------
Metrics for period to: 19:38:20(+0100) (width: 9.926s)
--------------------------------------

http.codes.504: ................................................................ 1047
http.response_time:
  min: ......................................................................... 40012
  max: ......................................................................... 48257
  median: ...................................................................... 41369.7
  p95: ......................................................................... 45720.8
  p99: ......................................................................... 46644.4
http.responses: ................................................................ 1047
vusers.completed: .............................................................. 1047
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 40039.5
  max: ......................................................................... 48273.3
  median: ...................................................................... 41369.7
  p95: ......................................................................... 45720.8
  p99: ......................................................................... 46644.4


--------------------------------------
Metrics for period to: 19:38:30(+0100) (width: 7.003s)
--------------------------------------

http.codes.504: ................................................................ 758
http.response_time:
  min: ......................................................................... 40001
  max: ......................................................................... 43180
  median: ...................................................................... 40550.5
  p95: ......................................................................... 41369.7
  p99: ......................................................................... 42205.5
http.responses: ................................................................ 758
vusers.completed: .............................................................. 758
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 40009.7
  max: ......................................................................... 43187.1
  median: ...................................................................... 40550.5
  p95: ......................................................................... 41369.7
  p99: ......................................................................... 42205.5


All VUs finished. Total time: 2 minutes, 30 seconds

--------------------------------
Summary report @ 19:38:29(+0100)
--------------------------------

http.codes.201: ................................................................ 1115
http.codes.400: ................................................................ 1681
http.codes.500: ................................................................ 16
http.codes.503: ................................................................ 10130
http.codes.504: ................................................................ 11088
http.request_rate: ............................................................. 205/sec
http.requests: ................................................................. 24030
http.response_time:
  min: ......................................................................... 17
  max: ......................................................................... 48257
  median: ...................................................................... 31897.9
  p95: ......................................................................... 43928
  p99: ......................................................................... 45720.8
http.responses: ................................................................ 24030
vusers.completed: .............................................................. 24030
vusers.created: ................................................................ 24030
vusers.created_by_name.Register in Race by Order: .............................. 24030
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20.3
  max: ......................................................................... 48273.3
  median: ...................................................................... 31897.9
  p95: ......................................................................... 43928
  p99: ......................................................................... 45720.8